app/views/users/show.html.erb

SELECT "reviews".* FROM "reviews"  WHERE "reviews"."user_id" = ?  [["user_id", 2]]
---
    <ul>
    <% @user.reviews.each do |review| %>