app/controllers/books_controller.rb

  def create
    @book = Book.new

    @book.title = params[:title]

    @book.author = params[:author]

    @book.year = params[:year]

    @book.category = params[:category]

    @book.picture = params[:picture]



    if @book.save
---
INSERT INTO "books" ("author", "category", "created_at", "picture", "title", "updated_at", "year") VALUES (?, ?, ?, ?, ?, ?, ?)