app/controllers/reviews_controller.rb

INSERT INTO "reviews" ("book_id", "created_at", "endDate", "enjoymentRating", "enlightenmentRating", "fullReview", "overallRating", "startDate", "summary", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @review = Review.new

    @review.book_id = params[:book_id]

    @review.user_id = params[:user_id]

    @review.summary = params[:summary]

    @review.fullReview = params[:fullReview]

    @review.startDate = params[:startDate]

    @review.endDate = params[:endDate]

    @review.enlightenmentRating = params[:enlightenmentRating]

    @review.enjoymentRating = params[:enjoymentRating]

    @review.overallRating = params[:overallRating]



    if @review.save