app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2014-11-20 14:53:13.314571"], ["updated_at", "2014-11-20 14:53:13.314571"]]
---
  def create
    @user = User.new

    @user.firstName = params[:firstName]

    @user.lastName = params[:lastName]

    @user.username = params[:username]

    @user.password = params[:password]

    @user.email = params[:email]



    if @user.save