app/views/reviews/edit.html.erb

SELECT "books".* FROM "books"
---
      <!-- <input type="text" id="book_id" name="book_id" placeholder="Book" class="form-control" value="<%= @review.book_id %>"> -->
      <%= select_tag(:book_id, options_from_collection_for_select(Book.all, :id, :title, @review.book_id), :class => "form-control") %>