app/views/reviews/new.html.erb

SELECT "books".* FROM "books"
---
      <!-- <input type="text" id="book_id" name="book_id" placeholder="Book" class="form-control" value="<%= @review.book_id %>"> -->
      <%= select_tag(:book_id, options_from_collection_for_select(Book.all, :id, :title, @review.book_id), :class => "form-control") %>

SELECT "users".* FROM "users"
---
<!--       <input type="text" id="user_id" name="user_id" placeholder="User" class="form-control" value="<%= @review.user_id %>"> -->
          <%= select_tag(:user_id, options_from_collection_for_select(User.all, :id, :username, @review.user_id), :class => "form-control") %>